[
  {
    "curso": "Formação Geral Bacharelado",
    "url": "https://www.in.gov.br/web/dou/-/portaria-n-339-de-28-de-maio-de-2025-632867948",
    "caracteristicas": "I - ético e comprometido com questões sociais, culturais e ambientais; II - comprometido com a democracia e com o exercício da cidadania; III - humanista, crítico e sensível, apoiado em conhecimentos científicos, sociais e culturais, historicamente construídos; IV - proativo e solidário na tomada de decisões, atuando com responsabilidade socioambiental e respeito às diferenças; V - colaborativo e propositivo no trabalho em equipes, redes ou comunidades, integrando diferentes áreas do conhecimento e tecnologias. ",
    "competencias": "I - competência em comunicação, expressão e interação social: envolve a capacidade de interpretar, produzir e compartilhar conteúdos de forma eficaz, a fim de promover o diálogo e a interação em diferentes contextos, sejam eles acadêmicos, profissionais ou culturais. a) habilidades vinculadas à competência I: 1. identificar diferentes expressões humanas, suas variações e significados em contextos específicos; 2. utilizar linguagem adequada ao público e ao contexto para comunicação de ideias e informações; 3. analisar diferentes linguagens e seus impactos na comunicação e na construção de significados; 4. avaliar diferentes argumentos de forma crítica, a fim de promover discussões fundamentadas; e 5. propor e implementar práticas de convivência que incentivem o diálogo e o compartilhamento de saberes em diferentes contextos socioculturais. II - competência em resolução de problemas e tomada de decisão: envolve a capacidade de analisar cenários complexos, identificar desafios e oportunidades e estruturar soluções para resolver problemas. b) habilidades vinculadas à competência II: 1. identificar soluções para situações-problema, considerando a complexidade e as variáveis envolvidas; 2. classificar e selecionar informações relevantes para tomar decisões e resolver problemas; 3. organizar processos e recursos a fim de implementar ações para resolução de problemas; 4. determinar abordagens adequadas para diferentes contextos de problemas, com base na análise profunda das condições envolvidas; e 5. criar e aplicar estratégias inovadoras para atender às necessidades emergentes, utilizando raciocínio crítico e criatividade. ",
    "assuntos": [
      "ética, democracia, cidadania e direitos humanos",
      "estado, sociedade e trabalho",
      "educação e desenvolvimento humano e social",
      "meio ambiente, mudanças climáticas e desafios socioambientais",
      "desigualdades, opressões e explorações étnico-raciais, de classe, de gênero e de sexualidade",
      "cultura, arte e comunicação",
      "ciência, tecnologia e inovação",
      "processos de globalização e política internacional",
      "cidades, habitação e qualidade de vida",
      "territórios, sociodiversidade e diversidade cultural",
      "acessibilidade e inclusão social",
      "promoção da saúde e prevenção de doenças"
    ]
  },
  {
    "curso": "Bacharelado em Administração",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-341-de-28-de-maio-de-2025-632856611",
    "caracteristicas": "I - crítico e reflexivo acerca do fenômeno organizacional em suas dimensões histórica, social, econômica, ambiental, política e cultural; II - analítico na compreensão da inter-relação entre os contextos regional, nacional e global, de forma sistêmica; III - proativo e responsável na tomada de decisões e na solução de problemas no âmbito das organizações, com atuação pautada no conhecimento científico e metodológico; IV - ético, criativo e inovador frente aos desafios organizacionais e às demandas sociais, envolvendo diversidade e sustentabilidade; e V - colaborativo e propositivo na liderança, integrando os interesses das diferentes áreas e promovendo o desenvolvimento de pessoas e de equipes. ",
    "competencias": "I - competência em gestão de pessoas, comunicação, recursos e processos sustentáveis: envolve o planejamento e a organização de pessoas e processos, a alocação eficiente de recursos, a implementação de modelos de negócios e estratégias, por meio da comunicação assertiva e de práticas sustentáveis, com o objetivo de alcançar o máximo desempenho organizacional. a) habilidades vinculadas à competência I: 1. Definir o modelo de negócios e as estratégias organizacionais no curto, médio e longo prazo. 2. Alocar de forma eficiente pessoas e recursos, considerando as estratégias organizacionais e a colaboração interdepartamental. 3. Criar e implementar planos de comunicação eficazes, tanto para públicos internos quanto externos. 4. Desenvolver pessoas e equipes, integrando práticas de negócio, sustentabilidade, inclusão e diversidade. 5. Monitorar processos e o engajamento das pessoas para garantir a efetividade dos resultados. II - competência em análise, planejamento e tomada de decisão: envolve a capacidade de identificar problemas e oportunidades, planejar soluções e tomar decisões efetivas com base em dados, informações e cenários, visando à melhoria contínua da organização. a) habilidades vinculadas à competência II: 1. Identificar problemas e oportunidades do contexto organizacional, diagnosticando suas causas e consequências; 2. Analisar os diferentes tipos de riscos e desafios de forma estruturada; 3. Planejar estratégias inovadoras para lidar com oportunidades e ameaças, alinhando-as às metas organizacionais; 4. Propor soluções eficientes por meio da utilização de ferramentas analíticas, considerando seus impactos; 5. Avaliar a eficácia das ações implementadas, ajustando estratégias com base em métricas de desempenho e feedback. ",
    "assuntos": [
      "antropologia, sociologia, ciência política, filosofia e ética",
      "psicologia e comportamento organizacional",
      "sistemas de informação e tecnologias da informação e comunicação",
      "ciências jurídicas, econômicas e contábeis",
      "teorias da administração e das organizações",
      "gestão de pessoas e relações de trabalho",
      "gestão comercial, marketing e serviços",
      "finanças",
      "operações, logística e cadeia de suprimentos",
      "gestão da qualidade",
      "planejamento e gestão estratégica",
      "gestão de projetos",
      "gestão de processos e serviços",
      "gestão da inovação e gestão do conhecimento",
      "empreendedorismo e modelos de negócio",
      "sustentabilidade, responsabilidade social corporativa e environmental, social and governance (esg)",
      "métodos quantitativos aplicados à administração",
      "métodos qualitativos aplicados à administração",
      "inteligência de dados, modelos e métodos de apoios à tomada de decisão"
    ]
  },
  {
    "curso": "Bacharelado em Ciências Contábeis",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-342-de-28-de-maio-de-2025-632872005",
    "caracteristicas": "I - proativo e propositivo na atuação em questões inerentes e afins à atividade contábil, em seus diversos contextos e modelos organizacionais; II - analítico e crítico na elaboração e na divulgação de informações aos usuários; III - atento às normas, aos regulamentos, aos padrões e às metodologias pertinentes às funções contábeis e suas respectivas atualizações e aplicações; IV - atualizado frente às inovações tecnológicas aplicáveis à atividade profissional; e V - ético e probo em sua atividade profissional, comprometido com a responsabilidade no âmbito social, ambiental e de governança nos ambientes das entidades, com o respeito às diversidades da sociedade. ",
    "competencias": "I - competência em produção da informação contábil: envolve o domínio dos conceitos fundamentais da contabilidade e a aplicação das normatizações e legislações vigentes; e permite a preparação e a apresentação de relatórios contábeis e das demonstrações financeiras em conformidade com a legislação, por meio de métodos, técnicas e ferramentas adequados ao reconhecimento, à mensuração e à divulgação de informações para a tomada de decisões. a) habilidades vinculadas à competência I: 1. identificar os conceitos fundamentais da ciência contábil e sua aplicação nas funções contábeis; 2. aplicar legislações, normas e pronunciamentos contábeis pertinentes ao processo de preparação e apresentação de demonstrações financeiras, relatórios técnicos, laudos ou pareceres; 3. selecionar métodos, técnicas e ferramentas adequados à produção da informação contábil, em conformidade com a legislação e com a ética profissional; 4. revisar as políticas, estimativas, alcance e abrangência das escolhas contábeis; e 5. propor alternativas para sanar não conformidades no processo de produção da informação contábil. II - competência em tomada de decisão e suporte ao processo decisório: envolve demonstrar a visão sistêmica e interdisciplinar da atividade contábil; permite a aplicação das capacidades crítica, analítica e decisória, alicerçadas em informações contábeis bem como em outras informações relevantes para a tomada de decisão; e inclui a participação e o aconselhamento na formulação do planejamento estratégico, no gerenciamento de riscos e no desenvolvimento de sistemas de informações contábeis e de controle gerencial, com o uso de tecnologias de informação. a) habilidades vinculadas à competência II: 1. identificar informações e evidências contábeis úteis para fundamentar a opinião profissional; 2. utilizar tecnologias de informação bem como técnicas quantitativas e qualitativas para suporte ao processo de tomada de decisão; 3. analisar informações financeiras e não financeiras; 4. propor alternativas para subsidiar o processo de tomada de decisão; 5. desenvolver e analisar sistemas de informações contábeis e de controle gerencial. ",
    "assuntos": [
      "teoria da contabilidade",
      "história da contabilidade e do pensamento contábil",
      "contabilidade societária",
      "contabilidade tributária",
      "contabilidade gerencial",
      "contabilidade de custos",
      "controladoria",
      "sistemas de informações contábeis",
      "contabilidade aplicada ao setor público",
      "auditoria",
      "perícia e arbitragem",
      "análise de demonstrações financeiras",
      "administração financeira",
      "legislação societária e empresarial",
      "legislação fiscal e tributária",
      "legislação social e trabalhista",
      "métodos quantitativos aplicados à contabilidade",
      "noções atuariais",
      "ética e legislação profissional",
      "contabilidade socioambiental"
    ]
  },
  {
    "curso": "Bacharelado em Ciências Econômicas",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-343-de-28-de-maio-de-2025-632877480",
    "caracteristicas": "I - atento às questões econômicas contemporâneas derivadas de uma realidade diversificada, global e em constante transformação; II - analítico e crítico na interpretação das questões econômicas de acordo com o contexto histórico, político, social e cultural; III - sensível e reflexivo na adoção da abordagem teórica, histórica e quantitativa, reconhecendo a pluralidade metodológica das ciências econômicas para propor soluções a problemas econômicos; IV - comprometido com a análise da realidade brasileira; e V - ético, coerente e responsável no tratamento das informações para subsidiar tomadas de decisão. ",
    "competencias": "I - competência em análise econômica e contextualização: envolve a compreensão e análise de mudanças institucionais, conjunturas econômicas e contextos históricos; a interpretação crítica de fatores econômicos que influenciam mercados, políticas públicas e decisões empresariais; e a avaliação das implicações dessas variáveis no cenário econômico atual e futuro. a) habilidades vinculadas à competência I: 1. identificar os principais fatores econômicos que afetam o comportamento e as decisões dos agentes; 2. compreender os mecanismos que influenciam a conjuntura econômica e os reflexos desta sobre a realidade socioeconômica brasileira; 3. interpretar a realidade socioeconômica a partir de bases teóricas e contextos históricos; 4. determinar as inter-relações entre as dimensões local, regional e global dos fenômenos socioeconômicos; e 5. avaliar as metodologias adequadas para analisar os efeitos das políticas econômicas em diferentes contextos socioeconômicos. II - competência em métodos quantitativos, planejamento e formulação de políticas econômicas: envolve a utilização de ferramentas matemáticas, estatísticas e gráficas para a análise econômica; a aplicação de métodos quantitativos para interpretar dados, modelar cenários e apoiar a tomada de decisões; e a formulação de políticas econômicas baseadas em análises consistentes e dados confiáveis. a) habilidades vinculadas à competência II: 1. identificar formulações matemáticas e estatísticas adequadas para a análise dos fenômenos socioeconômicos; 2. classificar os diferentes tipos de dados e informações necessárias para a aplicação das técnicas matemáticas e estatísticas; 3. aplicar modelos analíticos que integrem métodos matemáticos e estatísticos na avaliação de cenários econômicos; 4. analisar informações fornecidas por modelos econômicos, considerando a complexidade dos contextos sociais e políticos; e 5. avaliar estratégias e metodologias adequadas para elaborar e interpretar cenários econômicos, fundamentando as decisões em análises consistentes. ",
    "assuntos": [
      "estatística aplicada à economia",
      "matemática aplicada à economia",
      "econometria",
      "contabilidade social",
      "macroeconomia",
      "microeconomia",
      "economia industrial, da tecnologia e inovação",
      "economia política",
      "formação econômica do brasil",
      "economia brasileira contemporânea",
      "história econômica geral",
      "história do pensamento econômico",
      "economia internacional",
      "economia do setor público",
      "economia monetária e financeira",
      "desenvolvimento socioeconômico"
    ]
  },
  {
    "curso": "Bacharelado em Comunicação Social - Publicidade e Propaganda",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-345-de-28-de-maio-de-2025-632887883",
    "caracteristicas": "I - crítico, reflexivo e ético, com formação humanística e científica, capaz de atuar frente à complexidade das transformações do mundo contemporâneo, observando as demandas mercadológicas, institucionais, sociais e ambientais; II - inovador e empreendedor no planejamento, na execução e na avaliação dos processos comunicacionais e publicitários; III - estrategista no desenvolvimento das atividades de planejamento e gestão de comunicação integrada, monitorando e aferindo resultados a partir dos objetivos estipulados; IV - criativo na concepção e produção de peças, ações e campanhas comunicacionais e publicitárias; V - ético no exercício do marketing, da comunicação e da publicidade e em relação à diversidade das demandas mercadológicas, institucionais, sociais e ambientais. ",
    "competencias": "I - competência em pesquisa, análise e planejamento estratégico: envolve a capacidade de identificar oportunidades e desafios; analisar os ambientes mercadológico, institucional e social; desenvolver soluções estratégicas, a partir do marketing, da comunicação e da publicidade, com base em pesquisas para apoiar decisões. a) habilidades vinculadas à competência I: 1. identificar os impactos dos fatores macroambientais e microambientais no planejamento estratégico; 2. analisar processos mercadológicos e sociais, avaliando suas implicações no marketing, na comunicação e na publicidade; 3. desenvolver soluções estratégicas utilizando métodos e técnicas de marketing, comunicação e publicidade; 4. gerenciar fluxos de comunicação em variados meios, contemplando a inclusão e a diversidade de públicos; 5. avaliar os resultados das ações de marketing, comunicação e publicidade, com base em indicadores de desempenho e/ou pesquisas. II - competência em inovação, criação e produção em comunicação e publicidade: envolve a capacidade de inovar, criar e produzir soluções comunicacionais, alinhadas às demandas mercadológicas, institucionais, sociais e ambientais. a) habilidades vinculadas à competência II: 1. adotar visão inovadora, criativa e empreendedora sobre os novos modelos de negócios do campo comunicacional e publicitário; 2. definir estratégias criativas com base nos objetivos de comunicação, a partir de linguagens visual, verbal e sonora direcionadas aos diferentes públicos e meios; 3. conceber soluções criativas, diversas e inclusivas para diferentes contextos mercadológicos, institucionais, sociais e ambientais; 4. produzir peças, ações e campanhas comunicacionais e publicitárias alinhadas às estratégias criativas e adequadas às especificidades de cada meio; 5. incorporar as transformações da cultura tecnológica nas estratégias criativas de peças, ações e campanhas. ",
    "assuntos": [
      "teorias da comunicação",
      "história da comunicação e da publicidade e propaganda",
      "legislação e ética profissional",
      "metodologia e pesquisa em comunicação",
      "linguagens da comunicação",
      "comunicação e culturas tecnológicas",
      "teorias da imagem",
      "sociologia da comunicação",
      "psicologia da comunicação",
      "pesquisa de mercado e de comportamento do consumidor",
      "marketing e gestão de marcas",
      "planejamento e ferramentas de comunicação integrada",
      "planejamento de mídia e de pontos de contato",
      "criação publicitária e metodologias criativas",
      "redação publicitária",
      "direção de arte",
      "produção audiovisual, digital, fotográfica, gráfica e sonora",
      "gestão e resultados em publicidade e propaganda",
      "inovação e empreendedorismo",
      "comunicação pública e política"
    ]
  },
  {
    "curso": "Bacharelado em Comunicação Social - Jornalismo",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-344-de-28-de-maio-de-2025-632875341",
    "caracteristicas": "I - comprometido com a defesa da democracia, dos direitos humanos, do direito ao acesso à informação, da participação social e da liberdade de expressão; II - consciente das relações entre o campo de trabalho, a complexidade e a diversidade do mundo contemporâneo e os processos históricos, políticos, econômicos, socioambientais e culturais; III - ético e reflexivo quanto à produção, à circulação e à recepção dos conteúdos jornalísticos, considerando as transformações tecnológicas; IV - responsável, rigoroso e preciso nos processos de apuração, de registro e de divulgação dos fatos, primando pelo interesse público e pela integridade da informação; V - crítico e investigativo em relação ao poder exercido pelo jornalismo na construção de sentidos e na formação da opinião pública. ",
    "competencias": "I - competência em produção, edição e gestão jornalística: envolve a apuração, produção, edição, distribuição e circulação de conteúdos jornalísticos de qualidade em múltiplas linguagens; a seleção e a análise crítica de fontes; o desenvolvimento de narrativas; e a organização de projetos editoriais, com foco na excelência jornalística e com base nos preceitos éticos da profissão. a) habilidades vinculadas à competência I: 1. identificar pautas e temas relevantes, com base na análise crítica do contexto atual e das necessidades informativas de uma sociedade plural e diversa; 2. avaliar fontes de informação de acordo com critérios de pertinência, confiabilidade, pluralidade e independência, garantindo a qualidade ético-expressiva da produção jornalística; 3. conduzir entrevistas fundamentadas no respeito à dignidade humana e nos princípios éticos da profissão, com o objetivo de conhecer e verificar informações essenciais para a construção das narrativas jornalísticas; 4. contextualizar e explicar fatos e informações em suas dimensões históricas, políticas, econômicas, socioambientais e culturais, para oferecer uma cobertura precisa e de qualidade; 5. organizar as etapas de planejamento e execução de projetos editoriais, estabelecendo cronogramas, recursos necessários e equipes responsáveis para viabilizar a produção plural e diversa de conteúdos jornalísticos. II - competência em desenvolvimento de projetos e inovação: envolve a capacidade de planejar, executar e gerir diferentes processos de produção jornalística em organizações distintas, bem como ser capaz de aperfeiçoá-los pela inovação, colaboração e pelo exercício do pensamento crítico. a) habilidades vinculadas à competência II: I - definir as diretrizes e os objetivos para elaborar projetos de cunho jornalístico para diferentes públicos e instituições, de acordo com os padrões de qualidade e a ética profissional; II - conhecer abordagens inovadoras para empreender e gerir negócios jornalísticos, visando à sustentabilidade financeira e ao fortalecimento do ecossistema comunicacional e da democracia; III - reconhecer as dinâmicas e as competências necessárias para o trabalho em equipes interdisciplinares, valorizando a colaboração e o diálogo entre diferentes áreas de conhecimento para a qualificação dos produtos e das práticas jornalísticas; IV - executar projetos de assessoria jornalística articulados a outras áreas da comunicação organizacional em instituições de diferentes naturezas, tais como públicas, corporativas, comunitárias, sindicais ou não governamentais; V - utilizar, de forma crítica, os recursos tecnológicos disponíveis, com linguagens jornalísticas inovadoras e inclusivas, considerando o contexto da plataformização cultural, política e socioeconômica. ",
    "assuntos": [
      "teorias da comunicação",
      "teorias do jornalismo",
      "história do jornalismo",
      "linguagens jornalísticas",
      "sociologia e políticas de comunicação",
      "crítica da mídia",
      "metodologia e pesquisa em jornalismo",
      "ética e legislação em jornalismo",
      "gêneros e formatos jornalísticos",
      "jornalismo especializado",
      "jornalismo impresso",
      "fotojornalismo",
      "radiojornalismo e mídias sonoras",
      "telejornalismo e audiovisual",
      "jornalismo digital e plataformização",
      "jornalismo de dados",
      "planejamento gráfico e visual em jornalismo",
      "comunicação organizacional e assessoria de imprensa",
      "práticas, técnicas e processos produtivos contemporâneos em jornalismo",
      "educação midiática e combate à desinformação"
    ]
  },
  {
    "curso": "Bacharelado em Design",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-346-de-28-de-maio-de-2025-632884278",
    "caracteristicas": "I - articulado e expressivo no uso de linguagens e na comunicação de conceitos, ideias e soluções diversas; II - empático, ético e crítico às questões sociais, históricas, culturais e ambientais, em contextos locais e globais; III - comprometido em relação aos impactos dos fatores econômicos, materiais, tecnológicos e produtivos; IV - engajado com o conhecimento teórico-prático e a utilização de métodos projetuais, atendendo às demandas da sociedade; V - prospectivo e envolvido com visão sistêmica, criativa e interdisciplinar. ",
    "competencias": "I - competência em planejamento, estratégia e gestão no design: envolve a articulação de diferentes áreas de conhecimento para planejar, coordenar e garantir a viabilidade econômica e estratégica de projetos de design, alinhando-os com as necessidades do mercado e dos usuários. a) habilidades vinculadas à competência I: 1. reconhecer as áreas de conhecimento relevantes para um projeto de design e articular as atividades necessárias para sua realização; 2. identificar e organizar os componentes de um projeto de design, integrando diferentes áreas de atuação; 3. desenvolver estratégias para a efetividade e a inovação nos projetos, alinhadas aos objetivos estratégicos e às demandas da sociedade; 4. analisar o impacto ambiental e a viabilidade econômica, mercadológica e técnica dos projetos de design, considerando a sua sustentabilidade; 5. gerenciar o processo de design considerando visão estratégica em contextos e cenários diversificados. II - competência em criatividade, comunicação e cultura no design: envolve a aplicação de soluções criativas e funcionais no design, incorporando aspectos culturais, estéticos e simbólicos, garantindo-se que os produtos ou serviços criados se comuniquem de forma eficaz com os públicos. a) habilidades vinculadas à competência II: 1. propor linguagens e formas de comunicação baseados nos fundamentos do design para transmitir ideias e soluções de design; 2. selecionar os métodos, as técnicas e as ferramentas projetuais para o desenvolvimento de soluções de design em contextos diversificados; 3. integrar aspectos físicos, cognitivos e socioculturais no processo projetual, promovendo soluções inclusivas e eficazes; 4. incorporar aspectos históricos, estéticos e culturais no design, evidenciando suas contribuições para o processo projetual; 5. compreender a importância de abordagens multidisciplinares na articulação das necessidades, anseios e expectativas das pessoas. ",
    "assuntos": [
      "design, cultura e sociedade",
      "fundamentos da linguagem visual",
      "expressão e representação",
      "ergonomia nas interações humano/objeto/ambiente/organização",
      "comunicação e semiótica",
      "estética e história da arte",
      "história e teorias do design",
      "tecnologias, materiais, processos e meios produtivos",
      "metodologias de projeto",
      "gestão de design",
      "design e empreendedorismo",
      "design e inovação",
      "design e sustentabilidade",
      "design, inclusão e acessibilidade",
      "design, experiências e interfaces",
      "design e usabilidade",
      "design e propriedade intelectual",
      "cenários e tendências"
    ]
  },
  {
    "curso": "Bacharelado em Direito",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-347-de-28-de-maio-de-2025-632832018",
    "caracteristicas": "I - humanista, axiológico na atuação do Direito e com sólida formação geral; II - reflexivo e crítico para a adequada argumentação e interpretação dos fenômenos jurídicos e sociais; III - propositivo na elaboração de alternativas voltadas para a intervenção nas situações jurídico-sociais; IV - ético no exercício do Direito e na promoção do desenvolvimento da cidadania; V - autônomo e dinâmico na condução de sua própria aprendizagem. ",
    "competencias": "I - competência em análise jurídica e argumentação: envolve a capacidade de interpretar e construir argumentos sólidos no campo do direito, a análise de textos legais, doutrinários e jurisprudencial, identificar fenômenos jurídicos, aplicar normas, desenvolver argumentações coerentes e avaliar criticamente as implicações das interpretações legais, das normas e dos contextos em que foram produzidas. a) habilidades vinculadas à competência I: 1. identificar o fenômeno jurídico e os efeitos de sua aplicação, considerando os aspectos contextuais e as implicações legais; 2. classificar situações jurídicas de acordo com as normas e princípios aplicáveis, distinguindo suas características fundamentais e respectivas consequências legais; 3. desenvolver argumentações jurídicas coerentes, com base em raciocínios lógicos e análise crítica das normas, doutrina e jurisprudência pertinentes; 4. analisar e interpretar textos jurídicos, normativos e decisões judiciais, empregando instrumentos de metodologia jurídica e técnicas de pesquisas adequadas para extrair informações essenciais e compreender o alcance das normas; 5. avaliar as implicações de diferentes interpretações legais, considerando as consequências para os indivíduos, a sociedade e a ordem jurídica. II- competência em aplicação do direito, solução de controvérsias e inovação tecnológica: envolve a aplicação dos conhecimentos jurídicos de maneira prática, a busca de resolver conflitos por meio de negociações, mediações ou processos judiciais e também a adaptação do direito às inovações tecnológicas, reconhecendo-se o impacto das novas tecnologias nos processos jurídicos e nas relações sociais. a) habilidades vinculadas à competência II: 1. definir os fenômenos políticos, sociais e econômicos, analisando-os de forma interdisciplinar, para embasar a criação, interpretação e aplicação das normas jurídicas; 2. classificar os diferentes tipos de processos, atos e procedimentos jurídicos conforme a instância em que se inserem, com base nos princípios e normas pertinentes; 3. organizar estratégias jurídicas para a atuação técnico-jurídica eficaz, utilizando os procedimentos e instrumentos legais de forma sistemática e clara; 4. aplicar, de forma inovadora, métodos adequados de solução de controvérsias; 5. analisar os impactos das tecnologias no direito e as transformações causadas por inovações tecnológicas nos processos jurídicos nas relações sociais. ",
    "assuntos": [
      "antropologia e sociologia jurídicas",
      "psicologia jurídica",
      "filosofia do direito e ética",
      "história do direito",
      "teoria geral do direito",
      "teoria do estado e ciência política",
      "direito constitucional",
      "direito ambiental",
      "direito administrativo",
      "direito tributário",
      "direito penal",
      "direito civil",
      "direito econômico e economia política",
      "direito empresarial",
      "direito do consumidor",
      "direito do trabalho",
      "direito internacional",
      "direitos humanos",
      "direito processual e formas consensuais de solução de conflitos",
      "direito previdenciário"
    ]
  },
  {
    "curso": "Bacharelado em Psicologia",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-348-de-28-de-maio-de-2025-632871977",
    "caracteristicas": "I - comprometido com o aprimoramento contínuo, por meio da construção e do desenvolvimento do conhecimento em psicologia nas dimensões da ciência e da profissão; II - atento à compreensão dos fenômenos psicológicos, sociais, econômicos, culturais e políticos do país, considerando as complexidades, diversidades e multideterminações em interlocução com outros campos do conhecimento; III - ético e crítico no que diz respeito à atuação profissional, visando à promoção dos direitos humanos e de uma sociedade democrática, comprometido com o bem-estar dos indivíduos nos grupos, organizações e comunidades; IV - implicado de forma crítico-reflexiva na produção e na divulgação de pesquisas científicas, de trabalhos e de informações de temas relevantes para a psicologia e para a sociedade; V - comprometido com o estabelecimento de vínculos interpessoais que propiciem a atuação ética em equipes inter e multiprofissionais. ",
    "competencias": "I - competência em pesquisa e produção de conhecimento: envolve a condução de investigações científicas rigorosas, com análise crítica de dados e comunicação clara e eficaz dos resultados; e a criação de materiais de divulgação científica, a fim de promover a integração de diferentes perspectivas para o avanço do conhecimento na Psicologia. a) habilidades vinculadas à competência I: 1. conhecer fundamentos teórico-metodológicos e epistemológicos da Psicologia; 2. analisar a natureza dos fenômenos psicológicos de ordem cognitiva, comportamental e afetiva, considerando as características das populações-alvo; 3. conduzir investigações científicas estruturando etapas e estratégias metodológicas de pesquisa em Psicologia; 4. elaborar relatos científicos, documentos psicológicos e outras comunicações profissionais, inclusive materiais de divulgação, fundamentados em conhecimento técnico-científicos e princípios éticos da profissão; 5. desenvolver estratégias para intervenção em processos de trabalho junto a indivíduos, grupos e instituições. II - competência em avaliação, diagnóstico e intervenção psicológica: envolve a capacidade de identificar e compreender fenômenos psicológicos, nas dimensões individuais e grupais, conduzindo avaliações detalhadas e fundamentadas, além de desenvolver e aplicar intervenções em diversos contextos; e atuar de forma colaborativa de modo inter e multiprofissional, integrando saberes de diferentes áreas. a) habilidades vinculadas à competência II: 1. intervir em processos psicossociais junto a grupos e territórios, considerando as diferenças individuais e socioculturais dos seus membros com atenção especial aos segmentos em situação de vulnerabilidade social; 2. atuar em processos de prevenção e promoção da saúde em nível individual e coletivo; 3. realizar avaliação psicológica, psicodiagnóstico, psicoterapia e intervenções conforme as necessidades da população-alvo; 4. atuar inter e multiprofissionalmente na compreensão dos processos psicológicos e na colaboração em equipes multidisciplinares; 5. identificar processos educativos em diferentes contextos para avaliação, planejamento e intervenção. ",
    "assuntos": [
      "fundamentos epistemológicos e históricos da psicologia",
      "fundamentos, métodos e técnicas de investigação científica",
      "ética no exercício profissional",
      "direitos humanos em psicologia",
      "políticas públicas",
      "relações étnico-raciais",
      "diversidade sexual, de gênero e dos corpos",
      "bases biológicas do comportamento humano",
      "desenvolvimento humano",
      "processos psicológicos básicos",
      "processos psicopatológicos",
      "processos de avaliação psicológica",
      "processos grupais",
      "processos clínicos",
      "processos educativos e de aprendizagem",
      "intervenções em situações de emergências e desastres",
      "intervenções em processos institucionais e organizacionais",
      "intervenções em saúde e bem-estar do trabalhador",
      "intervenções em atenção e promoção da saúde",
      "intervenções em processos psicossociais"
    ]
  },
  {
    "curso": "Bacharelado em Relações Internacionais",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-349-de-28-de-maio-de-2025-632882622",
    "caracteristicas": "I - crítico e reflexivo na análise de questões internacionais no seu contexto político, econômico, histórico, geográfico, estratégico, jurídico, cultural, ambiental e social; II - ético e humanista na tomada de decisões, sensível à diversidade cultural, social, étnico-racial, religiosa, de gênero e de orientação sexual e comprometido com a promoção da dignidade humana em todas as esferas da sua atuação profissional; III - colaborativo e propositivo na mediação de conflitos, na busca de cooperação e na solução de problemas em uma realidade diversificada e em transformação; IV - analítico acerca de argumentos, de evidências, de discursos e de interpretações, com relação tanto a eventos e processos internacionais quanto a abordagens, teorias e perspectivas em relações internacionais; V - diligente e criativo na pesquisa, na análise, na avaliação e na formulação de cenários e de projetos para atuação nas esferas nacional, regional e internacional. ",
    "competencias": "I - competência em análise e estratégia das relações internacionais: envolve a capacidade de interpretar as dinâmicas globais e desenvolver uma análise crítica sobre os processos políticos, econômicos e sociais que moldam as relações internacionais. a) habilidades vinculadas à competência I: 1. identificar e analisar fenômenos históricos e contemporâneos nas relações internacionais, compreendendo seus impactos globais; 2. reconhecer e explicar problemas internacionais, considerando a diversidade das realidades local, regional e global; 3. desenvolver abordagens críticas sobre o impacto da política e da economia internacionais nas dimensões nacional, regional e global; 4. analisar interações entre diferentes atores das relações internacionais, reconhecendo estratégias e dinâmicas de poder e influência; 5. avaliar impactos das interações internacionais para atores e agentes em âmbito local, regional e global. II - competência em negociação, diplomacia e cooperação internacional: envolve a negociação, a atuação diplomática e a aplicação de estratégias para promover e gerenciar a cooperação entre atores das relações internacionais; o conhecimento do direito internacional e sua aplicação; e o domínio instrumental de língua estrangeira. a) habilidades vinculadas à competência II: 1. identificar e compreender objetivos e estratégias de política externa nas dinâmicas internacionais; 2. analisar e avaliar a formulação e execução de política externa; 3. definir estratégias de negociação que viabilizem projetos de cooperação internacional; 4. gerenciar recursos e parcerias para a execução de projetos internacionais, com vistas à internacionalização de organizações, tais como ONGs, OSCIPs, empresas e burocracias governamentais; 5. aplicar instrumentos diplomáticos e jurídicos para negociação e resolução de conflitos, respeitando as normas internacionais. ",
    "assuntos": [
      "teorias das relações internacionais",
      "economia política internacional",
      "instituições, regimes e organizações internacionais",
      "negociação e cooperação internacional",
      "direito internacional público e direitos humanos",
      "segurança internacional, estudos estratégicos e defesa",
      "análise de política externa",
      "política externa brasileira",
      "história das relações internacionais",
      "relações internacionais contemporâneas",
      "política internacional",
      "teoria política"
    ]
  },
  {
    "curso": "Formação Geral Tecnologia",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-340-de-28-de-maio-de-2025-632853393",
    "caracteristicas": "I - ético e comprometido com questões sociais, culturais e ambientais; II - comprometido com a democracia e com o exercício da cidadania; III - humanista, crítico e sensível, apoiado em conhecimentos científicos, sociais e culturais, historicamente construídos; IV - criativo, flexível e responsável com visão sistêmica e estratégica; e V - comunicativo e articulador nas diversas áreas organizacionais, atuando como facilitador na tomada de decisão. ",
    "competencias": "I - competência em comunicação, expressão e interação social: envolve a capacidade de interpretar, produzir e compartilhar conteúdos de forma eficaz, a fim de promover o diálogo e a interação em diferentes contextos, sejam eles acadêmicos, profissionais ou culturais. a) habilidades vinculadas à competência I: 1. utilizar linguagem adequada ao público e ao contexto para comunicação de ideias e informações; e 2. avaliar diferentes argumentos de forma crítica, a fim de promover discussões fundamentadas. II - competência em resolução de problemas e tomada de decisão: envolve a capacidade de analisar cenários complexos, identificar desafios e oportunidades e estruturar soluções para resolver problemas. a) habilidades vinculadas à competência II: 1. identificar soluções para situações-problema, considerando a complexidade e as variáveis envolvidas; 2. classificar e selecionar informações relevantes para tomar decisões e resolver problemas; e 3. organizar processos e recursos a fim de implementar ações para resolução de problemas. III - competência em análise e diagnóstico: envolve a capacidade de analisar dados e cenários, bem como identificar padrões, para embasar decisões estratégicas e aprimorar processos. a) habilidades vinculadas à competência III: 1. relacionar fatores e variáveis que afetam o cenário, possibilitando uma compreensão aprofundada da situação; e 2. avaliar a eficácia de decisões ou diagnósticos, verificando se os resultados atendem aos objetivos estabelecidos. IV - competência em desenvolvimento e implementação de estratégias: envolve a capacidade de formular e executar planos de ação estratégicos, organizando recursos e adaptando-se às demandas do ambiente para maximizar os resultados. a) habilidades vinculadas à competência IV: 1. definir objetivos e metas estratégicas de suas áreas alinhando recursos e ações necessárias para alcançá-los; 2. determinar métodos e abordagens adequadas para atingir a eficiência na implementação das estratégias; e 3. criar soluções inovadoras e escolher as alternativas de ação mais alinhadas aos objetivos da organização. ",
    "assuntos": [
      "ética, democracia, cidadania e direitos humanos",
      "estado, sociedade e trabalho",
      "educação e desenvolvimento humano e social",
      "meio ambiente, mudanças climáticas e desafios socioambientais",
      "desigualdades, opressões e explorações étnico-raciais, de classe, de gênero e de sexualidade",
      "análise do micro e do macroambiente",
      "estratégia organizacional",
      "métricas e monitoramento de resultados",
      "gestão de programas e projetos",
      "processos decisórios e técnicas de negociação",
      "estrutura organizacional e gestão de processos",
      "empreendedorismo, gestão e inovação",
      "cultura, arte e comunicação",
      "ciência, tecnologia e p&d",
      "globalização e política internacional"
    ]
  },
  {
    "curso": "Tecnologia em Design Gráfico",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-350-de-28-de-maio-de-2025-632878593",
    "caracteristicas": "I - criativo, flexível e responsável com visão sistêmica e estratégica; II - crítico-analítico e sensível às demandas dos indivíduos e dos grupos sociais; III - comprometido com a busca, com a construção e com o compartilhamento do conhecimento relacionado a sua atuação profissional; IV - protagonista e empreendedor na identificação de oportunidades para inovação. ",
    "competencias": "I - competência em planejamento, execução e inovação sustentável em projetos de design: envolve a capacidade de planejar, executar e inovar em projetos de design gráfico, considerando aspectos técnicos, operacionais, econômicos e sustentáveis; identificar necessidades; diagnosticar problemas; desenvolver soluções criativas; avaliar a viabilidade técnica e econômica; e incorporar práticas sustentáveis, com utilização de tecnologias e materiais que minimizem impactos ambientais. a) habilidades vinculadas à competência I: 1. identificar necessidades e requisitos do projeto, diagnosticando problemas e desafios a serem solucionados; 2. desenvolver soluções criativas e eficazes, alinhadas às demandas estéticas, funcionais, técnicas e socioeconômicas do projeto; 3. analisar a viabilidade técnica, socioeconômica e funcional das propostas, respeitando o contexto e os objetivos; 4. organizar as etapas do projeto, visando à alocação eficiente de recursos; 5. implementar soluções sustentáveis, utilizando metodologias e tecnologias que minimizem impactos socioeconômicos e ambientais. II - competência em acessibilidade, estética e contextualização no design: envolve a capacidade de criar designs estéticos, acessíveis e culturalmente relevantes, considerando especificidades locais e históricas; usar ferramentas digitais para otimizar processos criativos e garantir usabilidade e acessibilidade; integrar práticas inclusivas; comparar abordagens projetuais; e sistematizar informações para soluções eficazes e inovadoras. a) habilidades vinculadas à competência II: 1. considerar as especificidades culturais, históricas e estéticas locais e regionais no desenvolvimento dos projetos de design gráfico; 2. aplicar ferramentas digitais de forma adequada, considerando seu impacto nas fases criativas e produtivas do projeto; 3. implementar estratégias que priorizem usabilidade e acessibilidade, atendendo às necessidades de públicos diversos; 4. comparar e selecionar diferentes abordagens projetuais em termos de design, acessibilidade e impacto sociocultural; 5. utilizar informações de múltiplas áreas do conhecimento para criar soluções inovadoras, funcionais e inclusivas. ",
    "assuntos": [
      "história do design",
      "estudo das relações entre design, sociedade e cultura",
      "estudos da percepção visual: cor, imagem, estética e semiótica",
      "linguagem, expressão e representação visual",
      "metodologias do design",
      "estudos em ergonomia informacional",
      "materiais e produção gráfica",
      "tipografia",
      "fundamentos da computação gráfica",
      "design editorial",
      "desenvolvimento de interfaces em mídias digitais",
      "sistemas de identidade visual",
      "design de embalagem",
      "empreendedorismo, gestão e inovação",
      "ética e legislação aplicadas ao design",
      "design e sustentabilidade"
    ]
  },
  {
    "curso": "Tecnologia em Gestão Comercial",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-351-de-28-de-maio-de-2025-632876553",
    "caracteristicas": "I - reflexivo e crítico na condução de negócios comerciais; II - ético na atuação e comprometido com a responsabilidade socioambiental; III - analítico em informações de mercado; IV - negociador e assertivo nos relacionamentos comerciais; V - empreendedor no gerenciamento comercial de negócios. ",
    "competencias": "I - competência em análise e tomada de decisão comercial: envolve a capacidade de analisar diferentes cenários comerciais, utilizando dados financeiros, mercadológicos e de mercado para tomar decisões estratégicas informadas; a capacidade de identificar as variáveis que impactam diretamente os resultados comerciais; e a utilização destas informações para otimizar estratégias, identificar oportunidades e minimizar riscos, garantindo a sustentabilidade do negócio e seu alinhamento com os objetivos da organização. a) habilidades vinculadas à competência I: 1. identificar fatores internos e externos que influenciam cenários comerciais; 2. interpretar relatórios financeiros, contábeis e de mercado; 3. desenvolver estratégias com base em análises financeiras e mercadológicas; 4. analisar variáveis que impactam os custos e a formação de preços; 5. gerenciar a eficácia das decisões estratégicas. II - competência em gestão de processos comerciais e negociação: envolve a habilidade de planejar, organizar e otimizar os processos comerciais de uma organização; a capacidade de aplicar estratégias eficazes de negociação para fechar acordos vantajosos e garantir o bom desempenho comercial; a definição de processos eficientes de vendas; o acompanhamento do relacionamento com clientes e stakeholders; e a utilização de práticas inovadoras para garantir a expansão e o crescimento do negócio. a) habilidades vinculadas à competência II: 1. definir estratégias comerciais alinhadas aos objetivos da empresa; 2. organizar processos de compras, vendas e pós-venda; 3. criar soluções inovadoras para o desenvolvimento de novos mercados; 4. aplicar os métodos de negociação mais eficazes para alcançar objetivos comerciais; 5. gerir estrategicamente a área comercial considerando compra, venda e pós-venda. ",
    "assuntos": [
      "comércio eletrônico e mídias digitais",
      "comportamento do consumidor",
      "contabilidade gerencial",
      "custos e formação de preços",
      "direito aplicado ao comércio",
      "economia e mercado",
      "empreendedorismo",
      "estrutura organizacional e gestão de processos",
      "relacionamento com clientes",
      "finanças e orçamento",
      "logística empresarial",
      "gestão de pessoas e de equipes",
      "gestão de vendas",
      "gestão estratégica",
      "gestão mercadológica",
      "matemática financeira",
      "negociação e gestão de conflitos",
      "sistemas de informação comercial",
      "sustentabilidade e responsabilidade socioambiental",
      "compliance e lei geral de proteção de dados (lgpd)"
    ]
  },
  {
    "curso": "Tecnologia em Gestão de Recursos Humanos",
    "url": "https://www.in.gov.br/web/dou/-/portaria-n-352-de-28-de-maio-de-2025-632879467",
    "caracteristicas": "I - ético, crítico, holístico e humanista, comprometido com o embasamento científico, tecnológico e socioeconômico na gestão de recursos humanos e organizacional; II - empreendedor, dinâmico e inovador nas diversas etapas de planejamento, de implementação das práticas e de avaliação dos processos de gestão de recursos humanos; III - estratégico, com visão sistêmica, considerando os subsistemas de gestão de pessoas, na busca de vantagem competitiva; IV - resiliente e flexível às mudanças de cenários nos processos da gestão de recursos humanos, com proatividade e capacidade para liderança, contribuindo para os relacionamentos intra e interpessoais no âmbito de sua atuação profissional. ",
    "competencias": "I - competência em planejar, gerenciar e operacionalizar os subsistemas de gestão de recursos humanos: envolve a captação, a manutenção, a remuneração e a retenção de pessoas, bem como a compreensão da cultura e do clima organizacional e a capacidade de assegurar políticas e práticas de saúde, segurança e qualidade de vida no trabalho. a) habilidades vinculadas à competência I: 1. identificar necessidades e oportunidades nos processos de recrutamento, seleção, treinamento e desenvolvimento de pessoas; 2. classificar métodos e ferramentas de avaliação de desempenho, considerando diferentes contextos organizacionais; 3. desenvolver estratégias para gestão de cargos, salários, incentivos e benefícios, garantindo a competitividade e a satisfação dos colaboradores; 4. analisar a efetividade dos processos de recrutamento, seleção e desenvolvimento de pessoal, identificando oportunidades de melhorias; 5. relacionar práticas de gestão de pessoas com os objetivos estratégicos da organização, garantindo alinhamento e eficácia nos processos. II - competência em reconhecer, diagnosticar, formular e relacionar as políticas e práticas de recursos humanos: envolve ações de responsabilidade socioambiental, uso de ferramentas de comunicação e negociação, desenvolvimento de estilos de liderança e mediação de conflitos. a) habilidades vinculadas à competência II: 1. definir estratégias de gestão de pessoas, considerando planejamento, organização, direção e controle de atividades comerciais e organizacionais; 2. classificar diferentes estilos de liderança, avaliando sua influência nas relações e no desempenho organizacional; 3. organizar ações de desenvolvimento de carreiras, com foco no crescimento contínuo dos profissionais dentro da organização; 4. determinar critérios e métodos eficazes para negociação e mediação de conflitos, promovendo um ambiente harmonioso e produtivo; 5. avaliar programas e iniciativas que favoreçam a retenção de talentos e o desenvolvimento de uma cultura de engajamento na organização. ",
    "assuntos": [
      "comportamento organizacional",
      "comunicação organizacional",
      "cultura e clima organizacionais",
      "saúde e qualidade de vida no trabalho",
      "ética e responsabilidade socioambiental",
      "modelos de gestão e estilos de liderança",
      "gerenciamento de carreiras",
      "gestão por competências",
      "legislação trabalhista, tributária e previdenciária",
      "negociação e mediação de conflitos",
      "recrutamento e seleção",
      "gestão de cargos, salários e benefícios",
      "rotinas de pessoal e cálculos trabalhistas",
      "ergonomia e segurança no trabalho",
      "sistemas de informações gerenciais",
      "treinamento e desenvolvimento",
      "avaliação e gestão de desempenho",
      "gestão do conhecimento",
      "gestão estratégica e métricas de recursos humanos"
    ]
  },
  {
    "curso": "Tecnologia em Gestão Financeira",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-353-de-28-de-maio-de-2025-632852597",
    "caracteristicas": "I - ético e comprometido com os princípios legais, sociais e ambientais inerentes ao exercício profissional; II - propositivo e colaborativo, com visão sistêmica e estratégica; III - crítico e reflexivo na articulação de conceitos teóricos, de modelos, de instrumentos e de práticas de gestão financeira nas organizações; IV - analítico e responsável na utilização do instrumental para diagnóstico, para compreensão, para comunicação e para intervenção na gestão financeira; V - consciente e sensível com os cenários econômicos e seus impactos nos ambientes organizacionais. ",
    "competencias": "I - competência em planejamento financeiro e orçamentário: envolve a identificação de cenários financeiros, considerando aspectos econômicos, éticos, legais, ambientais, científicos e técnicos, com a aplicação de práticas inerentes ao planejamento financeiro; avaliação de indicadores financeiros, integração do plano orçamentário às necessidades da organização e gerenciamento de riscos, a fim de aproveitar oportunidades, com foco no crescimento sustentável. a) habilidades vinculadas à competência I: 1. identificar diferentes cenários financeiros, considerando aspectos econômicos, éticos, legais, ambientais, científicos e técnicos, para análise do contexto organizacional; 2. apresentar técnicas ou instrumentos que proporcionem práticas inerentes ao planejamento financeiro; 3. analisar o ambiente econômico e as questões conjunturais, buscando alinhar os objetivos organizacionais ao orçamento; 4. avaliar os indicadores financeiros e econômicos, mensurando os riscos envolvidos, para que o plano financeiro seja executado de forma adequada; 5. propor alternativas que integrem o plano orçamentário às necessidades da organização, mitigando os riscos, com foco no crescimento financeiro. II - competência em gestão dos recursos financeiros: envolve a utilização de práticas eficientes para gerenciar recursos financeiros, o que inclui a identificação e a avaliação de riscos financeiros, o uso de métodos quantitativos/qualitativos e a análise contínua do desempenho financeiro para tomada de decisões, com vistas a alinhar as decisões financeiras às circunstâncias de investimento e financiamento, de modo a atender às necessidades organizacionais. a) habilidades vinculadas à competência II: 1. definir conceitos financeiros aplicáveis ao cotidiano da gestão financeira; 2. utilizar métodos quantitativos/qualitativos na análise do desempenho financeiro para tomada de decisões; 3. analisar as fontes de financiamento que minimizem os custos financeiros; 4. avaliar as opções de investimento com foco na maximização de riqueza; 5. propor as alternativas de investimento e financiamento que atendam às necessidades organizacionais. ",
    "assuntos": [
      "análise de cenário econômico: indicadores e políticas macroeconômicas",
      "estrutura do balanço patrimonial, demonstração do resultado e fluxo de caixa",
      "análise das demonstrações contábeis",
      "matemática financeira",
      "análise de viabilidade econômico-financeira: vpl, tir e payback",
      "noções de custos empresariais",
      "planejamento financeiro",
      "captação, aplicação e controle de recursos financeiros",
      "mercado financeiro",
      "gestão do fluxo de caixa",
      "custos de capital",
      "planejamento, execução e controle orçamentário",
      "papel do gestor financeiro",
      "gestão de risco financeiro",
      "fontes de financiamento"
    ]
  },
  {
    "curso": "Tecnologia em Logística",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-355-de-28-de-maio-de-2025-632856506",
    "caracteristicas": "I - humanista, ético, reflexivo, crítico e responsável no desenvolvimento das dimensões econômica, social, ambiental e institucional; II - colaborativo, propositivo no trabalho em equipe e no atendimento às expectativas das partes interessadas; III - comprometido com o seu autodesenvolvimento e com a formação multidisciplinar continuada relacionada à logística; IV - inovador, criativo e flexível na execução de atividades logísticas, com resiliência e visão sistêmica, estratégica e voltada para as inovações tecnológicas e mercadológicas; V - analítico e resolutivo de problemas e de demandas do ambiente relacionado à logística. ",
    "competencias": "I - competência em planejamento e gestão de processos logísticos: envolve a capacidade de planejar, organizar, controlar e gerenciar as operações logísticas, desde o suprimento até a distribuição de recursos, com foco em otimizar fluxos de trabalho, garantir a disponibilidade de materiais e assegurar que as operações logísticas sejam executadas dentro dos prazos e custos previstos, a fim de aumentar a eficiência operacional e atender satisfatoriamente às demandas dos clientes. a) habilidades vinculadas à competência I: 1. identificar processos logísticos essenciais para otimizar a gestão da cadeia de suprimentos, desde o abastecimento até a pós-venda; 2. determinar as melhores práticas e metodologias para otimizar processos logísticos, incluindo a racionalização das operações e o aumento da eficiência; 3. classificar diferentes modelos de distribuição e transporte, considerando aspectos como custos, tempo e eficiência operacional; 4. planejar, organizar, conduzir e controlar operações logísticas de qualquer natureza; 5. implementar estratégias que integrem e melhorem a performance logística, alinhando fornecedores e clientes de forma eficaz; 6. desenvolver o capital humano como vantagem competitiva nas soluções logísticas; 7. avaliar indicadores operacionais para apoiar a tomada de decisões e fomentar a melhoria contínua nas atividades logísticas. II - competência em gestão da inovação e sustentabilidade na logística: envolve a implementação de estratégias sustentáveis aliadas ao uso de tecnologias inovadoras, bem como a otimização dos processos logísticos, com a finalidade de melhorar a eficiência operacional, reduzir os impactos socioambientais, aumentar a competitividade do mercado e promover práticas que atendam às necessidades ecológicas, sociais e econômicas. a) habilidades vinculadas à competência II: 1. definir tecnologias de informação e comunicação para otimizar os processos logísticos e agregar valor aos serviços prestados; 2. classificar as tendências inovadoras em logística, como automação, digitalização e outras tecnologias emergentes que aumentam a competitividade; 3. promover soluções inovadoras que minimizem impactos e atendam aos padrões de responsabilidade socioambiental que aprimorem a performance dos serviços logísticos e a experiência do cliente. ",
    "assuntos": [
      "fundamentos de logística",
      "marketing aplicado à logística",
      "gestão da cadeia de suprimentos",
      "logística de suprimentos",
      "armazenagem e administração de materiais",
      "sistemas de distribuição física",
      "gestão de estoques e demanda",
      "gestão de transportes",
      "pesquisa operacional aplicada à logística",
      "gestão de custos logísticos",
      "gestão da produção e operações",
      "logística internacional",
      "tecnologia da informação e comunicação aplicada à logística",
      "legislação aplicada à logística",
      "logística reversa e sustentável",
      "gestão da qualidade",
      "gestão de pessoas",
      "empreendedorismo e inovação",
      "estatística aplicada à logística"
    ]
  },
  {
    "curso": "Tecnologia em Marketing",
    "url": "https://www.in.gov.br/web/dou/-/portaria-n-356-de-28-de-maio-de-2025-632884856",
    "caracteristicas": "I - protagonista e agente de mudança na identificação de oportunidades para inovação na área do marketing e com capacidade de liderar e trabalhar com equipes multidisciplinares e multiculturais; II - ético, reflexivo, crítico e responsável no desenvolvimento das dimensões social, ambiental, econômica e institucional; III - comprometido com a educação permanente e atento às tendências mercadológicas e sociais; IV - autônomo, resolutivo e criativo, com espírito empreendedor; V - técnico e científico na sua atuação profissional, no âmbito da gestão e/ou da operação da atividade de marketing. ",
    "competencias": "I - competência em análise de mercado e comportamento de consumo: envolve a capacidade de diagnosticar e analisar informações relevantes referentes aos ambientes mercadológicos, bem como aos hábitos e às tendências de consumo. a) habilidades vinculadas à competência I: 1. identificar e contrastar as necessidades e os desejos dos clientes diante dos desafios mercadológicos; 2. mapear as diferentes características dos públicos-alvo e determinar as mais adequadas para cada tipo de mercado; 3. investigar comportamentos e tendências de consumo para gerenciar produtos, serviços e marcas; 4. formular diagnósticos mercadológicos a partir de ferramentas de análise relacionadas ao composto de marketing; 5. criar ações necessárias para promover experiências positivas e personalizadas, baseadas nas necessidades, nos desejos e nos comportamentos de consumo. II - competência em gestão e planejamento estratégico de marketing: envolve a capacidade de planejar, organizar, executar e avaliar ações de marketing de maneira estratégica, a fim de alinhar as necessidades do cliente aos objetivos da empresa. a) habilidades vinculadas à competência II: 1. determinar objetivos e estratégias de marketing eficazes para comunicar e criar relacionamentos duradouros com os clientes; 2. desenvolver e implementar planejamento de marketing que atenda às necessidades do mercado e proporcione soluções adequadas para os desafios do setor; 3. avaliar os resultados das ações de marketing, relacionar as métricas de desempenho e propor melhorias contínuas; 4. organizar as interações com os públicos-alvo em busca da promoção e do fortalecimento da marca; 5. formular estratégias de marketing que fortaleçam o vínculo entre a empresa e seus clientes, tanto on-line quanto off-line, para otimizar a experiência e os resultados. ",
    "assuntos": [
      "matrizes de análises ambientais",
      "comportamento do consumidor",
      "estratégias mercadológicas",
      "gestão e desenvolvimento de produtos e serviços",
      "formação de preço",
      "canais de distribuição",
      "comunicação integrada",
      "marketing de varejo",
      "marketing e negócios digitais",
      "ciência de dados e inteligência artificial",
      "criação e gestão de marcas",
      "pesquisa mercadológica",
      "ética, sustentabilidade e código de defesa do consumidor",
      "métricas e monitoramento de resultados",
      "criação de valor",
      "marketing de relacionamento",
      "trade marketing",
      "tópicos contemporâneos em marketing"
    ]
  },
  {
    "curso": "Tecnologia em Processos Gerenciais",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-357-de-28-de-maio-de-2025-632872611",
    "caracteristicas": "I - analítico, reflexivo e crítico no planejamento, na projeção e no gerenciamento dos processos organizacionais; II - perceptivo e proativo no atendimento às necessidades das áreas afins e na articulação de recursos organizacionais, atuando de forma sistêmica, empreendedora, colaborativa e inovadora; III - ético e responsável no âmbito socioambiental, respeitando as diversidades e visando à sustentabilidade na operacionalização dos processos gerenciais; IV - comunicativo e articulador nas diversas áreas organizacionais, atuando como facilitador na tomada de decisão. ",
    "competencias": "I - competência em planejamento e desenvolvimento organizacional: envolve o planejamento estratégico e o crescimento sustentável de uma organização; a análise de oportunidades de negócios; a gestão de recursos; a implementação de inovações; a capacidade de identificar as necessidades do mercado, integrar tecnologias e recursos organizacionais e formular estratégias eficazes para alcançar objetivos de longo prazo; e o monitoramento do impacto das operações no desempenho da empresa, com constante ajuste das abordagens para maximizar os resultados e garantir a sustentabilidade do negócio. a) habilidades vinculadas à competência I: 1. identificar, classificar e articular os recursos essenciais para o planejamento estratégico e o desenvolvimento de novos negócios; 2. analisar as necessidades organizacionais e tecnológicas para otimizar a utilização dos recursos disponíveis; 3. desenvolver estratégias para integrar recursos organizacionais e tecnológicos, visando à efetividade no alcance dos objetivos de negócio; 4. analisar processos gerenciais para propor soluções que atendam às demandas organizacionais; 5. avaliar estrategicamente o impacto dos processos gerenciais para otimizar o desempenho organizacional. II - competência em análise e aperfeiçoamento organizacional: envolve a avaliação contínua e a otimização dos fluxos de trabalho e sistemas internos de uma organização; a identificação de pontos críticos que impactam a eficiência das operações, a fim de implementar melhorias que aumentem a produtividade e reduzam custos; a capacidade de analisar dados operacionais e financeiros, propondo ajustes e soluções inovadoras para adaptar os processos às mudanças do mercado e às novas tecnologias; e a busca pela garantia de que os processos gerenciais sejam sempre eficientes, sustentáveis e alinhados com os objetivos estratégicos da organização. a) habilidades vinculadas à competência II: 1. classificar e categorizar informações de gestão para a melhoria contínua dos processos gerenciais; 2. coletar, organizar e interpretar dados para análises e diagnósticos na implementação da melhoria contínua; 3. mapear pontos críticos nos processos gerenciais e propor soluções para otimizar fluxos de trabalho e produtividade; 4. avaliar a viabilidade operacional dos processos gerenciais; 5. criar estratégias de aperfeiçoamento contínuo, fomentando ambientes inclusivos e colaborativos. ",
    "assuntos": [
      "análise do micro e do macroambiente",
      "estratégia organizacional",
      "processos de tomada de decisão",
      "comportamento organizacional e liderança",
      "análise do desempenho econômico-financeiro",
      "contabilidade gerencial",
      "comunicação e negociação",
      "gestão de pessoas",
      "gestão de marketing",
      "empreendedorismo, tecnologia e inovação",
      "gestão de processos",
      "gestão de operações e logística",
      "ética, diversidade e inclusão",
      "responsabilidade ambiental, social e de governança (asg)",
      "gestão da produção e da qualidade"
    ]
  },
  {
    "curso": "Formação Geral Licenciatura",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-315-de-26-de-maio-de-2025-632236512",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - planejar, implementar e avaliar ações nos âmbitos da prática docente, da gestão e organização das instituições de educação básica, das políticas públicas, dos projetos e dos programas educacionais, promovendo a interdisciplinaridade, o trabalho em equipe e em rede, de forma fundamentada na legislação. a) habilidades vinculadas à competência I: 1. demonstrar conhecimentos sobre a estrutura do sistema educacional brasileiro, as formas de gestão, as políticas, os currículos, os programas, considerando as determinações legais; 2. planejar intervenções fundamentadas na legislação e na avaliação da realidade escolar; 3. fomentar a cooperação entre as instituições de educação básica, a família e a comunidade; 4. identificar contradições, desafios, limites e possibilidades de superação de demandas da realidade educacional para propor intervenções de modo interdisciplinar; e 5. propor estratégias para o aperfeiçoamento da gestão e organização das políticas públicas, dos projetos e dos programas educacionais a partir do trabalho interdisciplinar em equipe e em rede. II - reconhecer a complexidade do fenômeno educativo e intervir de forma consciente de seu papel como docente, para promover a cidadania, o respeito aos direitos humanos e a sustentabilidade socioambiental, com vistas à formação integral dos estudantes. a) habilidades vinculadas à competência II: 1. planejar estratégias de ensino e de aprendizagem capazes de promover a cidadania, a sustentabilidade socioambiental e o respeito aos direitos humanos, considerando os conhecimentos e a realidade dos estudantes da educação básica; 2. propor estratégias educacionais para o enfrentamento das vulnerabilidades sociais presentes no contexto escolar decorrentes de fatores históricos e de desigualdades econômicas e socioespaciais; 3. planejar ações e projetos educacionais que contribuam com o desenvolvimento sustentável da sociedade; 4. elaborar propostas educacionais que promovam o direito às identidades sexuais, de gênero, étnicas, religiosas e etárias e às manifestações artísticas e culturais, a fim de garantir o respeito e a convivência democrática; e 5. elaborar propostas educacionais que proporcionem o conhecimento das histórias e culturas indígenas, afrobrasileiras e africanas pelos estudantes da educação básica. III - constituir a prática docente a partir da compreensão crítica da realidade social, política e cultural em sua complexidade, respeitando a diversidade de natureza ambiental-ecológica, étnico-racial, sexual, de gênero, de faixa geracional, de classe social, religiosa e do público-alvo da educação especial, entre outras, visando à integração de diferentes conhecimentos e perspectivas para a promoção de uma sociedade justa, equânime, igualitária e democrática. a) habilidades vinculadas à competência III: 1. reconhecer a diversidade e as diferenças que caracterizam a complexidade do processo educacional; 2. respeitar a diversidade e as diferenças na organização, no planejamento e na avaliação do processo de ensino e de aprendizagem e da gestão escolar; 3. planejar e avaliar os processos de ensino e de aprendizagem considerando a diversidade e as diferenças na organização e na gestão escolar; 4. integrar diferentes conhecimentos e perspectivas para analisar, solucionar e avaliar problemas da realidade social, política e cultural a fim de promover uma sociedade justa, equânime, igualitária e democrática; e 5. implementar práticas inclusivas de ensino e de aprendizagem considerando as diferenças e singularidades humanas em espaços escolares e não escolares. ",
    "assuntos": [
      "filosofia da educação",
      "história da educação",
      "sociologia da educação",
      "psicologia da educação",
      "teorias pedagógicas",
      "didática e metodologias de ensino",
      "teorias e práticas de currículo",
      "políticas públicas, organização, financiamento e avaliação da educação brasileira",
      "metodologia de pesquisa em educação e ensino",
      "tecnologias da comunicação e informação nas práticas educativas",
      "letramento científico",
      "educação especial e inclusiva",
      "libras, cultura e identidade surda",
      "identidade e especificidades do trabalho docente",
      "planejamento e avaliação do ensino e da aprendizagem",
      "práticas educativas para o processo de aprendizagem de crianças, adolescentes, jovens e adultos",
      "planejamento, organização e gestão democrática educacional em espaço escolar e não escolar",
      "implementação e avaliação de currículos, programas educacionais e projetos político-pedagógicos",
      "práticas de articulação entre escola, família, comunidade e movimentos sociais",
      "histórias e culturas africanas, afro-brasileiras e indígenas",
      "educação, inclusão e direitos humanos",
      "educação socioambiental",
      "educação para as relações de gênero e sexualidade",
      "educação para as relações étnico-raciais"
    ]
  },
  {
    "curso": "Licenciatura em Artes Visuais",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-316-de-26-de-maio-de-2025-632232619",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de artes visuais. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de artes visuais, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "artes visuais e produções artísticas contemporâneas",
      "arte indígena contemporânea e saberes dos povos indígenas",
      "saberes e arte de matrizes afro-brasileiras e quilombolas",
      "manifestações culturais e artísticas de diferentes etnias, classes, gêneros, sexualidades, religiões, escolaridades e/ou faixas etárias",
      "artes visuais e política (artivismo)",
      "patrimônio e políticas públicas (preservação, conservação e difusão)",
      "histórias das artes e culturas visuais (narrativas hegemônicas e contra-hegemônicas)",
      "relação entre artes visuais e questões socioambientais",
      "arte como trabalho e como produção cultural (sistema das artes e ação cultural)",
      "processos de criação do artista/professor/pesquisador",
      "fundamentos da linguagem visual e suas abordagens",
      "materiais, técnicas e procedimentos da prática artística no ensino de artes visuais",
      "fundamentos históricos, epistemológicos e metodológicos do ensino de artes visuais",
      "processos avaliativos no ensino de artes visuais",
      "interdisciplinaridade e interculturalidade no ensino de artes visuais",
      "processos de análise de imagem, percepção e experiência estética",
      "artes visuais, curadoria e mediação em espaços formais e não formais",
      "tecnologias da informação e comunicação no ensino de artes visuais",
      "legislação e políticas públicas para o ensino de artes visuais",
      "relações entre arte, ciência e tecnologias na formação do professor/pesquisador de artes visuais",
      "artes visuais e educação especial e inclusiva"
    ]
  },
  {
    "curso": "Licenciatura em Ciências Biológicas",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-317-de-26-de-maio-de-2025-632219329",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de Ciências Biológicas. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de Ciências Biológicas, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "aprendizagem de ciências e biologia",
      "ensino de ciências e biologia",
      "história, filosofia e sociologia no ensino de ciências e biologia",
      "bioquímica e biofísica",
      "microbiologia, imunologia e parasitologia",
      "biologia celular e do desenvolvimento",
      "genética e biotecnologia",
      "evolução",
      "zoologia",
      "botânica",
      "ecologia e biodiversidade",
      "diversidade étnico-racial, de gênero e inclusão no ensino de ciências e biologia",
      "educação ambiental",
      "ser humano e saúde",
      "bioestatística",
      "biogeografia e paleontologia",
      "bioética",
      "legislação e políticas públicas educacionais no ensino de ciências e biologia",
      "planejamento e métodos em pesquisa educacional no ensino de ciências e biologia",
      "etnobiologia no ensino de ciências e biologia",
      "currículo no ensino de ciências e de biologia"
    ]
  },
  {
    "curso": "Licenciatura em Ciências Sociais",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-318-de-26-de-maio-de-2025-632233580",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de Ciências Sociais. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de Ciências Sociais, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "teorias clássicas da antropologia",
      "teorias clássicas da ciência política",
      "teorias clássicas da sociologia",
      "teorias contemporâneas da antropologia",
      "teorias contemporâneas da ciência política",
      "teorias contemporâneas da sociologia",
      "temáticas contemporâneas das ciências sociais",
      "ciências sociais do brasil",
      "métodos e técnicas de pesquisa em ciências sociais",
      "didática e metodologias do ensino de ciências sociais",
      "ensino das ciências sociais na educação básica no brasil",
      "educação nas ciências sociais e",
      "epistemologias decoloniais"
    ]
  },
  {
    "curso": "Licenciatura em Computação",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-319-de-26-de-maio-de-2025-632239351",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de Computação. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de Computação, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "algoritmos e estruturas de dados",
      "engenharia de software",
      "interação homem-computador",
      "ética, computador e sociedade",
      "organização e arquitetura de computadores",
      "sistemas operacionais",
      "lógica e matemática discreta",
      "fundamentos e técnicas de programação",
      "paradigmas de linguagens de programação",
      "redes de computadores",
      "inteligência artificial",
      "bancos de dados",
      "tecnologias de ensino a distância",
      "teoria, metodologia e prática do ensino de computação",
      "tecnologias da informação e comunicação para educação",
      "informática na educação",
      "robótica educacional",
      "pensamento computacional",
      "produção de materiais didáticos digitais"
    ]
  },
  {
    "curso": "Licenciatura em Educação Física",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-320-de-26-de-maio-de-2025-632224653",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de Educação Física. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de Educação Física, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "dimensões históricas e filosóficas da educação física",
      "dimensões sociológicas e antropológicas da educação física",
      "dimensões morfofuncionais do movimento humano",
      "desenvolvimento humano e aprendizagem motora",
      "regulamentações e normatizações na educação física escolar",
      "educação física escolar na área de linguagens",
      "educação física na base nacional comum curricular (bncc)",
      "educação física nas etapas e modalidades da educação básica",
      "manifestações da educação física: brincadeiras e jogos, esportes, ginásticas, lutas, danças, práticas corporais de aventura",
      "concepções teórico-metodológicas da educação física escolar",
      "fundamentos didático-pedagógicos da educação física escolar",
      "prática educativa e dimensões do conhecimento na educação física escolar",
      "avaliação na educação física escolar",
      "educação física escolar inclusiva",
      "educação física, qualidade de vida e saúde",
      "pesquisa em educação física",
      "educação física escolar na contemporaneidade",
      "tecnologias e inovação em educação física escolar"
    ]
  },
  {
    "curso": "Licenciatura em Filosofia",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-321-de-26-de-maio-de-2025-632231233",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de Filosofia. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de Filosofia, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "cosmogonias e cosmologias",
      "epistemologias",
      "estética e filosofia da arte",
      "ética",
      "filosofia da educação",
      "filosofia da linguagem",
      "filosofia da mente",
      "filosofia das ciências",
      "filosofia das religiões",
      "filosofia decolonial",
      "filosofia do ensino de filosofia",
      "filosofia e questões de gênero",
      "filosofia e racionalidades",
      "filosofia política",
      "história da filosofia",
      "lógica",
      "metafísicas e ontologias",
      "metodologia e didática do ensino de filosofia",
      "mitologias e razão mítica",
      "pensamento filosófico no brasil"
    ]
  },
  {
    "curso": "Licenciatura em Física",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-322-de-26-de-maio-de-2025-632238639",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de Física. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de Física, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "física clássica: mecânica, fluidos, termodinâmica, eletromagnetismo, ondulatória e ótica",
      "física moderna e contemporânea",
      "práticas experimentais e o ensino de física",
      "dimensões histórica, sociológica e epistemológica e o ensino de física",
      "políticas educacionais e o ensino de física",
      "organização didático-curricular para o ensino de física",
      "teorias de aprendizagem e o ensino de física",
      "abordagens metodológicas para o ensino de física",
      "tecnologias digitais da informação e comunicação no ensino de física"
    ]
  },
  {
    "curso": "Licenciatura em Geografia",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-323-de-26-de-maio-de-2025-632236484",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de Geografia. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de Geografia, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "fundamentos epistemológicos do pensamento geográfico",
      "pressupostos teóricos que fundamentam as categorias geográficas de espaço, de região, de paisagem, de território e de lugar",
      "uso dos recursos naturais e questões socioambientais",
      "aspectos físico-geográficos e dinâmicas da paisagem",
      "dinâmica populacional, elementos demográficos e urbanização no brasil e no mundo",
      "saúde, população e ambiente",
      "sujeitos, processos e dinâmicas dos espaços agrários e rurais",
      "processos de regionalização no brasil e no mundo",
      "interações espaciais, fluxos e formação de redes geográficas",
      "reestruturação produtiva, sistema financeiro e produção (ou transformação) do espaço",
      "diversidade étnico-racial, de gênero e cultural em geografia",
      "geografia histórica e formação territorial do brasil",
      "movimentos sociais e dinâmicas espaciais",
      "geopolítica, geografia política, conflitos e redefinições territoriais",
      "cartografia escolar",
      "geotecnologias na educação geográfica",
      "pressupostos teóricos e metodológicos no ensino e na aprendizagem de geografia",
      "as diferentes linguagens na educação geográfica",
      "saberes, raciocínio geográfico e pensamento espacial nos diferentes contextos socioculturais",
      "comunidades tradicionais e suas territorialidades",
      "geografia inclusiva e direitos humanos",
      "cartografia tátil"
    ]
  },
  {
    "curso": "Licenciatura em História",
    "url": "https://www.in.gov.br/web/dou/-/portaria-n-324-de-26-de-maio-de-2025-632229168",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de História. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de História, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "teoria e metodologia de história",
      "teoria e metodologia do ensino de história",
      "história antiga",
      "história medieval",
      "história moderna",
      "história contemporânea",
      "história do brasil",
      "história da américa",
      "história da áfrica",
      "história da ásia",
      "história e cultura afro-brasileira",
      "história e cultura indígena",
      "história das relações de gênero",
      "ensino de história e direitos humanos"
    ]
  },
  {
    "curso": "Licenciatura em Letras Inglês",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-325-de-26-de-maio-de-2025-632134049",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de língua inglesa e literatura. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de língua inglesa e literatura, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "concepções de língua/linguagem, texto e discurso",
      "correntes linguísticas",
      "processos de letramentos",
      "aspectos pragmático-discursivos, fonológicos, morfossintáticos e léxico-gramaticais nos processos de compreensão e de produção de textos",
      "aspectos pragmático-discursivos, fonológicos, morfossintáticos e léxico-gramaticais nos processos de descrição e análise linguística",
      "fenômenos de variação, mudança e preconceito linguístico",
      "diversidade linguística e seus aspectos geopolíticos",
      "gêneros discursivos e textuais",
      "teorias de aquisição, de aprendizagem e de processamento da linguagem",
      "métodos e abordagens de ensino de língua e literatura",
      "tecnologias no processo de ensino e aprendizagem de língua e literatura",
      "avaliação do processo de ensino e aprendizagem de língua e literatura",
      "políticas linguísticas no ensino de língua e literatura",
      "aspectos decoloniais no ensino de língua e literatura",
      "articulações entre literatura, cultura e diversidade cultural e suas interfaces com demais sistemas artísticos e midiáticos e com outras áreas do conhecimento",
      "especificidades da linguagem literária",
      "gêneros literários: tradição e inovação",
      "letramento literário: literatura canônica e não canônica na formação do leitor",
      "movimentos literários e suas articulações interculturais",
      "métodos de investigação e pesquisa na área de língua e literatura em diversos contextos"
    ]
  },
  {
    "curso": "Licenciatura em Letras Português",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-326-de-26-de-maio-de-2025-632225567",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de língua portuguesa e literatura. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de língua portuguesa e literatura, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "concepções de língua (ou de linguagem) e suas implicações no ensino",
      "níveis de análise da língua",
      "formação histórica da língua portuguesa",
      "discurso, interdiscurso e produção de sentidos",
      "gêneros discursivos",
      "texto, tipologias e fatores de textualidade",
      "língua oral (produção, circulação e compreensão)",
      "língua escrita (produção, circulação e compreensão)",
      "variação, mudança e preconceito linguístico",
      "processos de letramento e de multiletramento",
      "concepções de literatura e de cultura",
      "especificidades da linguagem literária",
      "teorias críticas da literatura",
      "gêneros literários (tradição e inovação)",
      "movimentos literários no brasil e suas articulações interculturais",
      "letramento literário (aspectos teóricos e metodológicos)",
      "literatura canônica e não canônica na formação do leitor",
      "oralidade, performance e fruição no ensino de literatura",
      "inter-relações da língua e da literatura com outras semioses",
      "processos argumentativos e formação do leitor crítico"
    ]
  },
  {
    "curso": "Licenciatura em Letras Português-Espanhol",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-327-de-26-de-maio-de-2025-632242827",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de íngua portuguesa e espanhola e suas respectivas literaturas.. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de língua portuguesa e espanhola e suas respectivas literaturas, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "estudos linguísticos diacrônicos e sincrônicos",
      "aspectos fonéticos, fonológicos, morfológicos e sintáticos",
      "aspectos lexicais, estilísticos, semânticos, pragmáticos e discursivos",
      "aspectos socioculturais e interculturais em linguagens",
      "teorias linguísticas",
      "teorias de aquisição, de aprendizagem e de processamento da linguagem oral e escrita em língua materna e estrangeira",
      "gêneros discursivos e tipologias textuais",
      "textualidade e intertextualidade em estudos linguísticos e literários",
      "concepções de literatura e cultura",
      "estudos literários e culturais em línguas portuguesa e espanhola",
      "especificidades da linguagem literária",
      "inter-relações da língua e da literatura com outros sistemas culturais e semióticos",
      "multimodalidade e multiletramentos no ensino das línguas portuguesa e espanhola",
      "novas tecnologias integradas ao ensino de línguas e de literaturas",
      "teorias, abordagens e métodos de ensino de línguas e de literaturas",
      "didática do ensino de línguas e de literaturas",
      "estudos decoloniais no ensino de línguas e literaturas",
      "políticas linguísticas",
      "contrastes linguísticos entre as línguas portuguesa e espanhola",
      "material didático: elaboração, análise e avaliação"
    ]
  },
  {
    "curso": "Licenciatura em Letras Português-Inglês",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-328-de-26-de-maio-de-2025-632235352",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de língua portuguesa e inglesa e suas respectivas literaturas. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de língua portuguesa e inglesa e suas respectivas literaturas, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "concepções de língua/linguagem, texto e discurso",
      "correntes linguísticas",
      "processos de letramentos",
      "aspectos pragmático-discursivos, fonológicos, morfossintáticos e léxico-gramaticais nos processos de compreensão e de produção de textos",
      "aspectos pragmático-discursivos, fonológicos, morfossintáticos e léxico-gramaticais nos processos de descrição e análise linguística",
      "fenômenos de variação, mudança e preconceito linguístico",
      "diversidade linguística e seus aspectos geopolíticos",
      "gêneros discursivos e textuais",
      "teorias de aquisição, de aprendizagem e de processamento da linguagem",
      "métodos e abordagens de ensino de língua e literatura",
      "tecnologias no processo de ensino e aprendizagem de língua e literatura",
      "avaliação do processo de ensino e aprendizagem de língua e literatura",
      "políticas linguísticas no ensino de língua e literatura",
      "aspectos decoloniais no ensino de língua e literatura",
      "articulações entre literatura, cultura e diversidade cultural e suas interfaces com demais sistemas artísticos e midiáticos e com outras áreas do conhecimento",
      "especificidades da linguagem literária",
      "gêneros literários: tradição e inovação",
      "letramento literário: literatura canônica e não canônica na formação do leitor",
      "movimentos literários e suas articulações interculturais",
      "métodos de investigação e pesquisa na área de língua inglesa e suas literaturas em diversos contextos"
    ]
  },
  {
    "curso": "Licenciatura em Matemática",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-330-de-26-de-maio-de-2025-632237819",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de Matemática. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de Matemática, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "conteúdos matemáticos da educação básica",
      "fundamentos de geometria",
      "geometria analítica",
      "fundamentos de análise",
      "álgebra linear",
      "fundamentos de álgebra e aritmética",
      "teoria dos números",
      "probabilidade e estatística",
      "observação, análise e planejamento dos conteúdos e métodos de ensino em matemática na educação básica",
      "processos de avaliação em matemática na educação básica",
      "recursos didáticos de matemática para a educação básica",
      "contextos históricos e culturais no/do ensino da matemática",
      "tendências em educação matemática",
      "educação matemática inclusiva"
    ]
  },
  {
    "curso": "Licenciatura em Música",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-329-de-26-de-maio-de-2025-632226061",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de Música. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de Música, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "impacto social do fazer musical sem discriminação",
      "relações de poder, de gênero e de sexualidade nos âmbitos da produção, da distribuição e do consumo de música",
      "educação musical inclusiva",
      "desenvolvimento cognitivo, afetivo e social no contexto do ensino e da aprendizagem de música",
      "histórias e culturas de matrizes de povos indígenas para o ensino de música",
      "histórias e culturas de matrizes africanas, afro-brasileiras e afro-diaspóricas",
      "educação musical e interculturalidade para o acolhimento de movimentos migratórios",
      "educação socioambiental e ensino de música",
      "abordagens e metodologias de ensino e aprendizagem musical",
      "estágio docente em música (planejamento, prática e avaliação)",
      "práticas avaliativas em educação musical",
      "pesquisa em processos de ensino e de aprendizagem em música",
      "práticas musicais (estilos, gêneros e repertórios em diferentes contextos sociais, históricos e culturais)",
      "tecnologias para educação musical",
      "criação musical no contexto de ensino e aprendizagem",
      "códigos e sistemas teórico-musicais (tradição oral e escrita)",
      "elementos perceptivos, teóricos, analíticos, estéticos e estruturais da música",
      "harmonia, arranjo, composição e improvisação para o repertório didático-musical"
    ]
  },
  {
    "curso": "Licenciatura em Pedagogia",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-331-de-26-de-maio-de-2025-632239272",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de Pedagogia. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de Pedagogia, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "antropologia da educação",
      "trabalho e educação",
      "fundamentos metodológicos específicos do ensino de língua portuguesa, matemática, ciências, geografia, história, artes e educação física",
      "corpo, movimento e ludicidade",
      "alfabetização e letramento",
      "letramento literário",
      "políticas de educação infantil",
      "criança e infância (conceitos e características)",
      "ensino, currículo e práticas interdisciplinares",
      "atuação de pedagogos em espaços não escolares",
      "concepções de aprendizagem e de desenvolvimento da criança na educação infantil e nos anos iniciais",
      "concepções de aprendizagem e desenvolvimento de adolescentes, de jovens, de adultos e de idosos",
      "práticas educativas para o processo de aprendizagem de crianças, de jovens, de adultos e de idosos",
      "práticas de atendimento educacional especializado",
      "educação do/no campo e movimentos sociais",
      "pedagogia como ciência da prática educativa",
      "relação de ensino e aprendizagem e as dificuldades no processo de escolarização",
      "práticas de ensino na educação infantil",
      "políticas e práticas de avaliação",
      "organização, planejamento e gestão da educação"
    ]
  },
  {
    "curso": "Licenciatura em Química",
    "url": "https://www.in.gov.br/en/web/dou/-/portaria-n-332-de-26-de-maio-de-2025-632232459",
    "caracteristicas": "I - responsável e comprometido com os princípios éticos, estéticos e políticos com vistas à construção de uma sociedade democrática, justa, equânime e igualitária; II - reflexivo e com postura investigativa e científica para o exercício da docência e da cidadania plena; III - competente nas abordagens didático-pedagógicas, com o domínio dos conteúdos específicos e dos fundamentos teórico-metodológicos no âmbito de sua área de atuação, de forma contextualizada, interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação; IV - comprometido com a democratização do acesso à educação de qualidade, com vistas ao enfrentamento das desigualdades e das injustiças sociais; V - comprometido com o respeito às diferenças e às diversidades ambiental-ecológicas, étnico-raciais, de gênero, geracionais, de classe social, religiosas, sexuais, culturais, políticas, do público-alvo da educação especial, entre outras; e VI - crítico, colaborativo e propositivo na organização e na gestão do trabalho pedagógico e das instituições educativas, na atuação em equipe e em rede, fundamentado na legislação educacional. ",
    "competencias": "I - selecionar, analisar, adaptar, elaborar e utilizar metodologias de ensino, recursos didáticos e processos avaliativos que empreguem variadas linguagens e tecnologias, de maneira crítica e significativa, favorecendo a produção de conhecimentos, a autonomia discente e a valorização da identidade dos envolvidos no processo de ensino e de aprendizagem de Química. a) habilidades vinculadas à competência I: 1. identificar os fundamentos teórico-metodológicos do ensino; 2. selecionar e utilizar diferentes metodologias de ensino e recursos didáticos; 3. associar diferentes linguagens e tecnologias ao planejamento de ensino; 4. elaborar um plano de aula que favoreça a produção de conhecimentos e a autonomia discente; 5. selecionar, crítica e significativamente, ações que promovam a autonomia discente; e 6. planejar e conduzir avaliações acerca dos processos de produção de conhecimento, de promoção da autonomia e de valorização discente. II - dominar e aplicar os conhecimentos teórico-práticos e as linguagens específicas do ensino de Química, as abordagens didático-pedagógicas e os fundamentos teórico-metodológicos da educação, de forma interdisciplinar e adequada a diferentes fases do desenvolvimento humano, etapas e modalidades da educação básica. a) habilidades vinculadas à competência II: 1. promover o pensamento crítico sobre questões sociais decorrentes dos impactos da ciência e da tecnologia na sociedade; 2. propor aos estudantes problemas cujas resoluções estimulem uma postura investigativa e científica, a apropriação e a disseminação de conhecimento; 3. relacionar as abordagens didático-pedagógicas com os conhecimentos teórico-práticos; 4. aplicar os conhecimentos teórico-práticos e as linguagens específicas de forma interdisciplinar; 5. avaliar domínios cognitivos de acordo com as diferentes etapas e modalidades da educação básica, considerando as diferentes fases do desenvolvimento humano; e 6. elaborar proposta de intervenção adequada à determinada etapa da educação básica. ",
    "assuntos": [
      "estudo de substâncias e suas transformações",
      "elementos químicos, periodicidade e estrutura atômica",
      "estrutura molecular e de sólidos iônicos e metálicos",
      "gases e termodinâmica",
      "equilíbrio químico",
      "cinética química",
      "eletroquímica",
      "compostos inorgânicos (estrutura, propriedades e reações)",
      "compostos orgânicos (estrutura, propriedades, reações e mecanismos)",
      "bioquímica (estruturas de biomoléculas, catálise enzimática, biossíntese e metabolismo)",
      "educação ambiental",
      "experimentação no ensino de química",
      "história da química, filosofia e epistemologia da ciência e sua relação com o ensino de química",
      "projetos e propostas curriculares, políticas públicas e suas implicações para o ensino de química",
      "o lúdico no ensino de química",
      "enfoque ciência, tecnologia e socidade (cts) no ensino de química",
      "tecnologias digitais da informação e comunicação nas práticas educativas",
      "ensino de química na diversidade e interculturalidade",
      "educação especial, educação inclusiva, cultura surda e libras",
      "educação em espaços não escolares e divulgação científica"
    ]
  }
]